examples/openfoam/fluidBed/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)  // 0 
    (0.044 0 0) // 1
    (0.044 0.120 0) //2 
    (0 0.120 0) //3
    (0 0 0.01) //4 
    (0.044 0 0.01) //5 
    (0.044 0.120 0.01) //6 
    (0 0.120 0.01) //7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 3 6 7)
        );
    }


    outlet
    {
        type patch; 
        faces
        (
            (0 1 5 4)
        );
    }



    walls
    {
        type wall; 
        faces 
        (
            (4 7 3 0)
            (5 1 2 6)
        ); 
    }



    frontBack
    {
        type symmetry;  
        faces 
        (
            (0 1 2 3)
            (4 5 6 7)
        ); 
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
