examples/openfoam/fluidBed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       540;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       552;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       564;
    }
    frontBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          576;
        startFace       612;
    }
)

// ************************************************************************* //
