examples/openfoam/fluidBed/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhaseName fluid;

rho.fluid         1.205; 
partDensity       1000; 


transportModel  Newtonian;
nu              1.516e-05; 

// ************************************************************************* //
