examples/openfoam/fluidBed/0/p

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;


boundaryField
{
    inlet
    {
        type            fixedFluxPressure; 
        phi             phi.fluid; 
        value           $internalField; 
    }


    outlet
    {
        type            fixedValue;
        phi             phi.fluid; 
        value           $internalField; 
    }

    walls
    {
        type            fixedFluxPressure; 
        phi             phi.fluid; 
        value           $internalField; 
    }


    frontBack 
    {
        type            symmetry;
    }


}
































// ************************************************************************* //
