examples/openfoam/fluidBed/0/uSource

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      uSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }


    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }


    walls
    {
        type            calculated;
        value           uniform (0 0 0); 
    
    }



    frontBack
    {
        type            symmetry; 
    }

}

// ************************************************************************* //
