examples/openfoam/fluidBed/0/uSourceDrag

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      uSourceDrag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0 ;

boundaryField
{


    inlet
    {
        type            calculated;
        value           uniform 0; 
    }


    outlet
    {
        type            calculated;
        value           uniform 0; 
    }


    walls
    {
        type            calculated;
        value           uniform 0; 
    
    }



    frontBack
    {
        type            symmetry; 
    
    }
}

// ************************************************************************* //
