examples/openfoam/fluidBed/system/fvSchemes

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(alphaPhi.fluid,U.fluid)    Gauss linearUpwindV unlimited;
    div(((alpha.fluid*nuEff.fluid)*dev2(T(grad(U.fluid))))) Gauss linear; 
    div(phi.fluid,U.fluid) Gauss linearUpwindV unlimited; 
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
